app/controllers/resturants_controller.rb

SELECT "resturants".* FROM "resturants" ORDER BY Created_at DESC
---
  def index
    @resturants = Resturant.all.order("Created_at DESC")

INSERT INTO "resturants" ("name", "description", "location", "phone", "email", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)
---
  def create
    @resturant = Resturant.new(resturant_params)

    respond_to do |format|
      if @resturant.save

UPDATE "resturants" SET "email" = ?, "updated_at" = ? WHERE "resturants"."id" = ?  [["email", "Person.find_by_sql ['SELECT * from restaurant WHERE name = ?', name]"], ["updated_at", "2019-09-09 00:49:18.733648"], ["id", 3]]
---
  def update
    respond_to do |format|
      if @resturant.update(resturant_params)

SELECT  "resturants".* FROM "resturants" WHERE "resturants"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_resturant
      @resturant = Resturant.find(params[:id])