app/controllers/reviews_controller.rb

    def create
        @review = Review.new(review_params)
        # set review's X_ID to selected X's ID
        @review.resturant_id = @resturant.id
        @review.user_id = current_user.id #will cause issues if unAuth user accesses the new_resturant_review_path

        if @review.save
---
INSERT INTO "reviews" ("rating", "comment", "created_at", "updated_at", "user_id", "resturant_id") VALUES (?, ?, ?, ?, ?, ?)  [["rating", 3], ["comment", "Cool Restaurant"], ["created_at", "2019-09-07 22:01:26.610153"], ["updated_at", "2019-09-07 22:01:26.610153"], ["user_id", 1], ["resturant_id", 1]]

    def update
        @review = Review.find(params[:id])

        if @review.update(review_params)
---
SELECT  "reviews".* FROM "reviews" WHERE "reviews"."id" = ? LIMIT ?  [["id", 7], ["LIMIT", 1]]
UPDATE "reviews" SET "comment" = ?, "updated_at" = ? WHERE "reviews"."id" = ?  [["comment", "another One!!!!"], ["updated_at", "2019-09-10 01:00:49.509477"], ["id", 7]]

        def find_resturant
            @resturant = Resturant.find(params[:resturant_id])
---
SELECT  "resturants".* FROM "resturants" WHERE "resturants"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

        def find_review
            @review = Review.find(params[:id])
---
SELECT  "reviews".* FROM "reviews" WHERE "reviews"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]